app/controllers/names_controller.rb

  def index
    @names = Name.all
---
SELECT "names".* FROM "names"